In [1]:
import numpy as np;
import pandas as pd;

FINDING MISSING DATA

In [9]:
data ={
    "A":[1,2,np.nan,4,5],
    "B":[1,2,3,4,5],
    "C":[1,2,3,np.nan,np.nan],
    "D":[1,np.nan,np.nan,np.nan,5]
}

df = pd.DataFrame(data)

In [3]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

Finding nan

In [5]:
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [6]:
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [10]:
# REMOVING VALUES
print(df)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [11]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [15]:
# threshold => non null vaues
df.dropna(thresh=1)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

FILLING MISSING VALUES

In [16]:
print(df)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [17]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [18]:
# unique value for each column
values={"A":0,"B":100,"C":"300","D":"400"}
df.fillna(value=values)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  400
2  0.0  3  3.0  400
3  4.0  4  300  400
4  5.0  5  300  5.0